"" Last update: 14.10.2018 16.57
"" .vimrc  файл конфирурации для текстового редактора VIM
""=======================================================

"" Настройка цветовой схемы
colorscheme desert

"" Включает поддержку мыши в режиме ввода
set mouse=i

"" Включает подсветку вариантов в режиме ввода команд
set wildmenu

"" Настройка удобства написания
set showmatch "Подсвечивает первую скобку при вводе второй

"" Настройка поиска по файлу
set hlsearch "Подсвечивает все варианты поиска
set incsearch "Подсвечивает варианты в процессе написание строки поиска
set ignorecase "Игнорирование регистра при поиске

"" Настройка отступов и табуляции
set tabstop=4
set shiftwidth=4
set smarttab
set expandtab
set autoindent

"" Подсвечивать табы и пробелы в конце строки
set list "Включение подсветки
set listchars=tab:>-,trail:- "Выбор символов для подсветки
